---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightType.GetInitialColor
source: html/e0fdfc8c-c842-1291-3993-e66efa501953.htm
---
# Autodesk.Revit.DB.Lighting.LightType.GetInitialColor Method

Return a copy of an object derived from InitialColor

## Syntax (C#)
```csharp
public InitialColor GetInitialColor()
```